espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG27/Include/efr32mg27_usart.h
/* Bit fields for USART CTRLX */
#define _USART_CTRLX_RESETVALUE                 0x00000000UL                            /**< Default value for USART_CTRLX               */
#define _USART_CTRLX_MASK                       0x8000808FUL                            /**< Mask for USART_CTRLX                        */
#define USART_CTRLX_DBGHALT                     (0x1UL << 0)                            /**< Debug halt                                  */
#define _USART_CTRLX_DBGHALT_SHIFT              0                                       /**< Shift value for USART_DBGHALT               */
#define _USART_CTRLX_DBGHALT_MASK               0x1UL                                   /**< Bit mask for USART_DBGHALT                  */
#define _USART_CTRLX_DBGHALT_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for USART_CTRLX                */
#define _USART_CTRLX_DBGHALT_DISABLE            0x00000000UL                            /**< Mode DISABLE for USART_CTRLX                */
#define _USART_CTRLX_DBGHALT_ENABLE             0x00000001UL                            /**< Mode ENABLE for USART_CTRLX                 */
#define USART_CTRLX_DBGHALT_DEFAULT             (_USART_CTRLX_DBGHALT_DEFAULT << 0)     /**< Shifted mode DEFAULT for USART_CTRLX        */
#define USART_CTRLX_DBGHALT_DISABLE             (_USART_CTRLX_DBGHALT_DISABLE << 0)     /**< Shifted mode DISABLE for USART_CTRLX        */
#define USART_CTRLX_DBGHALT_ENABLE              (_USART_CTRLX_DBGHALT_ENABLE << 0)      /**< Shifted mode ENABLE for USART_CTRLX         */
#define USART_CTRLX_CTSINV                      (0x1UL << 1)                            /**< CTS Pin Inversion                           */
#define _USART_CTRLX_CTSINV_SHIFT               1                                       /**< Shift value for USART_CTSINV                */
#define _USART_CTRLX_CTSINV_MASK                0x2UL                                   /**< Bit mask for USART_CTSINV                   */
#define _USART_CTRLX_CTSINV_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for USART_CTRLX                */
#define _USART_CTRLX_CTSINV_DISABLE             0x00000000UL                            /**< Mode DISABLE for USART_CTRLX                */
#define _USART_CTRLX_CTSINV_ENABLE              0x00000001UL                            /**< Mode ENABLE for USART_CTRLX                 */
#define USART_CTRLX_CTSINV_DEFAULT              (_USART_CTRLX_CTSINV_DEFAULT << 1)      /**< Shifted mode DEFAULT for USART_CTRLX        */
#define USART_CTRLX_CTSINV_DISABLE              (_USART_CTRLX_CTSINV_DISABLE << 1)      /**< Shifted mode DISABLE for USART_CTRLX        */
#define USART_CTRLX_CTSINV_ENABLE               (_USART_CTRLX_CTSINV_ENABLE << 1)       /**< Shifted mode ENABLE for USART_CTRLX         */
#define USART_CTRLX_CTSEN                       (0x1UL << 2)                            /**< CTS Function enabled                        */
#define _USART_CTRLX_CTSEN_SHIFT                2                                       /**< Shift value for USART_CTSEN                 */
#define _USART_CTRLX_CTSEN_MASK                 0x4UL                                   /**< Bit mask for USART_CTSEN                    */
#define _USART_CTRLX_CTSEN_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for USART_CTRLX                */
#define _USART_CTRLX_CTSEN_DISABLE              0x00000000UL                            /**< Mode DISABLE for USART_CTRLX                */
#define _USART_CTRLX_CTSEN_ENABLE               0x00000001UL                            /**< Mode ENABLE for USART_CTRLX                 */
#define USART_CTRLX_CTSEN_DEFAULT               (_USART_CTRLX_CTSEN_DEFAULT << 2)       /**< Shifted mode DEFAULT for USART_CTRLX        */
#define USART_CTRLX_CTSEN_DISABLE               (_USART_CTRLX_CTSEN_DISABLE << 2)       /**< Shifted mode DISABLE for USART_CTRLX        */
#define USART_CTRLX_CTSEN_ENABLE                (_USART_CTRLX_CTSEN_ENABLE << 2)        /**< Shifted mode ENABLE for USART_CTRLX         */
#define USART_CTRLX_RTSINV                      (0x1UL << 3)                            /**< RTS Pin Inversion                           */
#define _USART_CTRLX_RTSINV_SHIFT               3                                       /**< Shift value for USART_RTSINV                */
#define _USART_CTRLX_RTSINV_MASK                0x8UL                                   /**< Bit mask for USART_RTSINV                   */
#define _USART_CTRLX_RTSINV_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for USART_CTRLX                */
#define _USART_CTRLX_RTSINV_DISABLE             0x00000000UL                            /**< Mode DISABLE for USART_CTRLX                */
#define _USART_CTRLX_RTSINV_ENABLE              0x00000001UL                            /**< Mode ENABLE for USART_CTRLX                 */
#define USART_CTRLX_RTSINV_DEFAULT              (_USART_CTRLX_RTSINV_DEFAULT << 3)      /**< Shifted mode DEFAULT for USART_CTRLX        */
#define USART_CTRLX_RTSINV_DISABLE              (_USART_CTRLX_RTSINV_DISABLE << 3)      /**< Shifted mode DISABLE for USART_CTRLX        */
#define USART_CTRLX_RTSINV_ENABLE               (_USART_CTRLX_RTSINV_ENABLE << 3)       /**< Shifted mode ENABLE for USART_CTRLX         */
#define USART_CTRLX_RXPRSEN                     (0x1UL << 7)                            /**< PRS RX Enable                               */
#define _USART_CTRLX_RXPRSEN_SHIFT              7                                       /**< Shift value for USART_RXPRSEN               */
#define _USART_CTRLX_RXPRSEN_MASK               0x80UL                                  /**< Bit mask for USART_RXPRSEN                  */
#define _USART_CTRLX_RXPRSEN_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for USART_CTRLX                */
#define USART_CTRLX_RXPRSEN_DEFAULT             (_USART_CTRLX_RXPRSEN_DEFAULT << 7)     /**< Shifted mode DEFAULT for USART_CTRLX        */
#define USART_CTRLX_CLKPRSEN                    (0x1UL << 15)                           /**< PRS CLK Enable                              */
#define _USART_CTRLX_CLKPRSEN_SHIFT             15                                      /**< Shift value for USART_CLKPRSEN              */
#define _USART_CTRLX_CLKPRSEN_MASK              0x8000UL                                /**< Bit mask for USART_CLKPRSEN                 */
#define _USART_CTRLX_CLKPRSEN_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for USART_CTRLX                */
#define USART_CTRLX_CLKPRSEN_DEFAULT            (_USART_CTRLX_CLKPRSEN_DEFAULT << 15)   /**< Shifted mode DEFAULT for USART_CTRLX        */

/* Bit fields for USART TIMECMP0 */
#define _USART_TIMECMP0_RESETVALUE              0x00000000UL                              /**< Default value for USART_TIMECMP0            */
#define _USART_TIMECMP0_MASK                    0x017700FFUL                              /**< Mask for USART_TIMECMP0                     */
#define _USART_TIMECMP0_TCMPVAL_SHIFT           0                                         /**< Shift value for USART_TCMPVAL               */
#define _USART_TIMECMP0_TCMPVAL_MASK            0xFFUL                                    /**< Bit mask for USART_TCMPVAL                  */
#define _USART_TIMECMP0_TCMPVAL_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for USART_TIMECMP0             */
#define USART_TIMECMP0_TCMPVAL_DEFAULT          (_USART_TIMECMP0_TCMPVAL_DEFAULT << 0)    /**< Shifted mode DEFAULT for USART_TIMECMP0     */
#define _USART_TIMECMP0_TSTART_SHIFT            16                                        /**< Shift value for USART_TSTART                */
#define _USART_TIMECMP0_TSTART_MASK             0x70000UL                                 /**< Bit mask for USART_TSTART                   */
#define _USART_TIMECMP0_TSTART_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for USART_TIMECMP0             */
#define _USART_TIMECMP0_TSTART_DISABLE          0x00000000UL                              /**< Mode DISABLE for USART_TIMECMP0             */
#define _USART_TIMECMP0_TSTART_TXEOF            0x00000001UL                              /**< Mode TXEOF for USART_TIMECMP0               */
#define _USART_TIMECMP0_TSTART_TXC              0x00000002UL                              /**< Mode TXC for USART_TIMECMP0                 */
#define _USART_TIMECMP0_TSTART_RXACT            0x00000003UL                              /**< Mode RXACT for USART_TIMECMP0               */
#define _USART_TIMECMP0_TSTART_RXEOF            0x00000004UL                              /**< Mode RXEOF for USART_TIMECMP0               */
#define USART_TIMECMP0_TSTART_DEFAULT           (_USART_TIMECMP0_TSTART_DEFAULT << 16)    /**< Shifted mode DEFAULT for USART_TIMECMP0     */
#define USART_TIMECMP0_TSTART_DISABLE           (_USART_TIMECMP0_TSTART_DISABLE << 16)    /**< Shifted mode DISABLE for USART_TIMECMP0     */
#define USART_TIMECMP0_TSTART_TXEOF             (_USART_TIMECMP0_TSTART_TXEOF << 16)      /**< Shifted mode TXEOF for USART_TIMECMP0       */
#define USART_TIMECMP0_TSTART_TXC               (_USART_TIMECMP0_TSTART_TXC << 16)        /**< Shifted mode TXC for USART_TIMECMP0         */
#define USART_TIMECMP0_TSTART_RXACT             (_USART_TIMECMP0_TSTART_RXACT << 16)      /**< Shifted mode RXACT for USART_TIMECMP0       */
#define USART_TIMECMP0_TSTART_RXEOF             (_USART_TIMECMP0_TSTART_RXEOF << 16)      /**< Shifted mode RXEOF for USART_TIMECMP0       */
#define _USART_TIMECMP0_TSTOP_SHIFT             20                                        /**< Shift value for USART_TSTOP                 */
#define _USART_TIMECMP0_TSTOP_MASK              0x700000UL                                /**< Bit mask for USART_TSTOP                    */
#define _USART_TIMECMP0_TSTOP_DEFAULT           0x00000000UL                              /**< Mode DEFAULT for USART_TIMECMP0             */
#define _USART_TIMECMP0_TSTOP_TCMP0             0x00000000UL                              /**< Mode TCMP0 for USART_TIMECMP0               */
#define _USART_TIMECMP0_TSTOP_TXST              0x00000001UL                              /**< Mode TXST for USART_TIMECMP0                */
#define _USART_TIMECMP0_TSTOP_RXACT             0x00000002UL                              /**< Mode RXACT for USART_TIMECMP0               */
#define _USART_TIMECMP0_TSTOP_RXACTN            0x00000003UL                              /**< Mode RXACTN for USART_TIMECMP0              */
#define USART_TIMECMP0_TSTOP_DEFAULT            (_USART_TIMECMP0_TSTOP_DEFAULT << 20)     /**< Shifted mode DEFAULT for USART_TIMECMP0     */
#define USART_TIMECMP0_TSTOP_TCMP0              (_USART_TIMECMP0_TSTOP_TCMP0 << 20)       /**< Shifted mode TCMP0 for USART_TIMECMP0       */
#define USART_TIMECMP0_TSTOP_TXST               (_USART_TIMECMP0_TSTOP_TXST << 20)        /**< Shifted mode TXST for USART_TIMECMP0        */
#define USART_TIMECMP0_TSTOP_RXACT              (_USART_TIMECMP0_TSTOP_RXACT << 20)       /**< Shifted mode RXACT for USART_TIMECMP0       */
#define USART_TIMECMP0_TSTOP_RXACTN             (_USART_TIMECMP0_TSTOP_RXACTN << 20)      /**< Shifted mode RXACTN for USART_TIMECMP0      */
#define USART_TIMECMP0_RESTARTEN                (0x1UL << 24)                             /**< Restart Timer on TCMP0                      */
#define _USART_TIMECMP0_RESTARTEN_SHIFT         24                                        /**< Shift value for USART_RESTARTEN             */
#define _USART_TIMECMP0_RESTARTEN_MASK          0x1000000UL                               /**< Bit mask for USART_RESTARTEN                */
#define _USART_TIMECMP0_RESTARTEN_DEFAULT       0x00000000UL                              /**< Mode DEFAULT for USART_TIMECMP0             */
#define _USART_TIMECMP0_RESTARTEN_DISABLE       0x00000000UL                              /**< Mode DISABLE for USART_TIMECMP0             */
#define _USART_TIMECMP0_RESTARTEN_ENABLE        0x00000001UL                              /**< Mode ENABLE for USART_TIMECMP0              */
#define USART_TIMECMP0_RESTARTEN_DEFAULT        (_USART_TIMECMP0_RESTARTEN_DEFAULT << 24) /**< Shifted mode DEFAULT for USART_TIMECMP0     */
#define USART_TIMECMP0_RESTARTEN_DISABLE        (_USART_TIMECMP0_RESTARTEN_DISABLE << 24) /**< Shifted mode DISABLE for USART_TIMECMP0     */
#define USART_TIMECMP0_RESTARTEN_ENABLE         (_USART_TIMECMP0_RESTARTEN_ENABLE << 24)  /**< Shifted mode ENABLE for USART_TIMECMP0      */

